---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShorterThanMinWall
source: html/851be6c3-dd0e-3b03-b0b2-e4c431b573cf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShorterThanMinWall Property

Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].

## Syntax (C#)
```csharp
public static FailureDefinitionId ShorterThanMinWall { get; }
```